Project/Toir/src/ChartsOfCharacteristicTypes/торо_ГруппыХарактеристикОборудования/торо_ГруппыХарактеристикОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>торо_ГруппыХарактеристикОборудования</name>
  <type>
    <types>EnumRef.торо_ТипЭксплуатации</types>
    <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    <types>CatalogRef.торо_МерыБезопасности</types>
    <types>CatalogRef.ВидыНоменклатуры</types>
    <types>CatalogRef.торо_ПричиныИзмененияНаработки</types>
    <types>CatalogRef.торо_ТехнологическиеОперации</types>
    <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
    <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.торо_ТиповыеОР</types>
    <types>CatalogRef.Должности</types>
    <types>CatalogRef.торо_ЦепочкиРемонта</types>
    <types>CatalogRef.УпаковкиНоменклатуры</types>
    <types>EnumRef.Периодичность</types>
    <types>CatalogRef.Сотрудники</types>
    <types>CatalogRef.торо_ВидыПусковОР</types>
    <types>CatalogRef.ПапкиФайлов</types>
    <types>EnumRef.СтавкиНДС</types>
    <types>CatalogRef.торо_ПричиныДефектов</types>
    <types>CatalogRef.торо_РесурсыРемонтнойБригады</types>
    <types>EnumRef.торо_ОтветственныеЛица</types>
    <types>CatalogRef.торо_ОбъектыРемонта</types>
    <types>EnumRef.торо_ВидыСравнения</types>
    <types>EnumRef.ТипыНоменклатуры</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.ДоговорыКонтрагентов</types>
    <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    <types>CatalogRef.торо_ВидыЭксплуатации</types>
    <types>CatalogRef.ЗначенияСвойствОбъектовИерархия</types>
    <types>EnumRef.ГрадацииКачества</types>
    <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>CatalogRef.ВидыЦен</types>
    <types>Boolean</types>
    <types>CatalogRef.торо_УсловияВыявленияДефекта</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>EnumRef.РолиСотрудников</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.РассылкиОтчетов</types>
    <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    <types>CatalogRef.СерииНоменклатуры</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.ПроизводственныеКалендари</types>
    <types>EnumRef.торо_УсловияРабот</types>
    <types>CatalogRef.торо_ПричиныЗакрытияРемонтов</types>
    <types>String</types>
    <types>CatalogRef.торо_КритичностьДефекта</types>
    <types>CatalogRef.торо_ПричиныПростояОборудования</types>
    <types>Date</types>
    <types>CatalogRef.СтраныМира</types>
    <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
    <types>CatalogRef.торо_СтруктурыОР</types>
    <types>Number</types>
    <types>CatalogRef.торо_ПриоритетыОбъектовРемонта</types>
    <types>CatalogRef.торо_РемонтныеБригады</types>
    <types>CatalogRef.Производители</types>
    <types>EnumRef.торо_СтатусыОРВУчете</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.Организации</types>
    <types>EnumRef.торо_СпособыВыполненияРемонтов</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>EnumRef.ВидыКадровыхСобытий</types>
    <types>CatalogRef.торо_Комиссии</types>
    <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    <types>EnumRef.СпособыСтроительства</types>
    <types>CatalogRef.ЕдиницыИзмерения</types>
    <types>EnumRef.торо_ВидыПростояОборудования</types>
    <types>EnumRef.ТипыСкладов</types>
    <types>EnumRef.ВидыЗанятости</types>
    <types>EnumRef.ТипыДоговоров</types>
    <types>EnumRef.ДниНедели</types>
    <types>CatalogRef.торо_Сезоны</types>
    <types>CatalogRef.Календари</types>
    <types>CatalogRef.торо_ВидыРемонтов</types>
    <types>CatalogRef.торо_ВидыДефектов</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
  </type>
  <attributes>
    <name>ЗаполнятьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокХарактеристик</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыАвтозаполнения</name>
    <attributes>
      <name>НаименованиеХарактеристики</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

Project/Toir/src/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения/ДополнительныеРеквизитыИСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ДополнительныеРеквизитыИСведения</name>
  <type>
    <types>EnumRef.торо_ТипЭксплуатации</types>
    <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    <types>CatalogRef.торо_МерыБезопасности</types>
    <types>CatalogRef.ВидыНоменклатуры</types>
    <types>CatalogRef.торо_ПричиныИзмененияНаработки</types>
    <types>CatalogRef.торо_ТехнологическиеОперации</types>
    <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
    <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.торо_ТиповыеОР</types>
    <types>CatalogRef.Должности</types>
    <types>CatalogRef.торо_ЦепочкиРемонта</types>
    <types>CatalogRef.УпаковкиНоменклатуры</types>
    <types>EnumRef.Периодичность</types>
    <types>CatalogRef.Сотрудники</types>
    <types>CatalogRef.торо_ВидыПусковОР</types>
    <types>CatalogRef.ПапкиФайлов</types>
    <types>EnumRef.СтавкиНДС</types>
    <types>CatalogRef.торо_ПричиныДефектов</types>
    <types>CatalogRef.торо_РесурсыРемонтнойБригады</types>
    <types>EnumRef.торо_ОтветственныеЛица</types>
    <types>CatalogRef.торо_ОбъектыРемонта</types>
    <types>EnumRef.торо_ВидыСравнения</types>
    <types>EnumRef.ТипыНоменклатуры</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.ДоговорыКонтрагентов</types>
    <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    <types>CatalogRef.торо_ВидыЭксплуатации</types>
    <types>CatalogRef.ЗначенияСвойствОбъектовИерархия</types>
    <types>EnumRef.ГрадацииКачества</types>
    <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>CatalogRef.ВидыЦен</types>
    <types>Boolean</types>
    <types>CatalogRef.торо_УсловияВыявленияДефекта</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>EnumRef.РолиСотрудников</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.РассылкиОтчетов</types>
    <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    <types>CatalogRef.СерииНоменклатуры</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.ПроизводственныеКалендари</types>
    <types>EnumRef.торо_УсловияРабот</types>
    <types>CatalogRef.торо_ПричиныЗакрытияРемонтов</types>
    <types>String</types>
    <types>CatalogRef.торо_КритичностьДефекта</types>
    <types>CatalogRef.торо_ПричиныПростояОборудования</types>
    <types>Date</types>
    <types>CatalogRef.СтраныМира</types>
    <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
    <types>CatalogRef.торо_СтруктурыОР</types>
    <types>Number</types>
    <types>CatalogRef.торо_ПриоритетыОбъектовРемонта</types>
    <types>CatalogRef.торо_РемонтныеБригады</types>
    <types>CatalogRef.Производители</types>
    <types>EnumRef.торо_СтатусыОРВУчете</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.Организации</types>
    <types>EnumRef.торо_СпособыВыполненияРемонтов</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>EnumRef.ВидыКадровыхСобытий</types>
    <types>CatalogRef.торо_Комиссии</types>
    <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    <types>EnumRef.СпособыСтроительства</types>
    <types>CatalogRef.ЕдиницыИзмерения</types>
    <types>EnumRef.торо_ВидыПростояОборудования</types>
    <types>EnumRef.ТипыСкладов</types>
    <types>EnumRef.ВидыЗанятости</types>
    <types>EnumRef.ТипыДоговоров</types>
    <types>EnumRef.ДниНедели</types>
    <types>CatalogRef.торо_Сезоны</types>
    <types>CatalogRef.Календари</types>
    <types>CatalogRef.торо_ВидыРемонтов</types>
    <types>CatalogRef.торо_ВидыДефектов</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
  </type>
  <attributes>
    <name>Виден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецДополнительныхЗначений</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьВВидеГиперссылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеЗначенияИспользуются</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеЗначенияСВесом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доступен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокФормыВыбораЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокФормыЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьОбязательно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МногострочноеПолеВвода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСклоненияПредмета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматСвойства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДополнительноеСведение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗависимостиДополнительныхРеквизитов</name>
    <attributes>
      <name>ЗависимоеСвойство</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>String</types>
        <stringQualifiers>
          <length>99</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подсказка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаголовокФормыЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаголовокФормыВыбораЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

Project/Toir/src/ChartsOfCharacteristicTypes/торо_ГруппыХарактеристикОборудования/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если ЗаполнятьАвтоматически И Не(ДополнительныеСвойства.Свойство("ТолькоЗапись") И ДополнительныеСвойства.ТолькоЗапись=Истина) Тогда 
		СписокХарактеристик.Очистить();
		//
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	торо_ГруппыХарактеристикОборудованияПараметрыАвтозаполнения.НаименованиеХарактеристики КАК Имя
			|ПОМЕСТИТЬ Искомые
			|ИЗ
			|	ПланВидовХарактеристик.торо_ГруппыХарактеристикОборудования.ПараметрыАвтозаполнения КАК торо_ГруппыХарактеристикОборудованияПараметрыАвтозаполнения
			|ГДЕ
			|	торо_ГруппыХарактеристикОборудованияПараметрыАвтозаполнения.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
			|ИЗ
			|	Искомые КАК Искомые
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
			|		ПО Искомые.Имя = ДополнительныеРеквизитыИСведения.Заголовок";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой()=Ложь Тогда 
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				НС = СписокХарактеристик.Добавить();
				НС.Характеристика = Выборка.Ссылка;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
